app/controllers/users_controller.rb

  	def create
      @user =User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
      @user = User.find(params[:id])
      # @user= User.find(params[:id])
      if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 18 LIMIT 1
UPDATE "users" SET "email" = ?, "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 37  [["email", "trantoan11112@gmail.com"], ["name", "trantaon1212"], ["password_digest", "$2a$10$V6G7/5mUMZFvZ6zQ1qOt7uSOLap/8d3RB.T7I.fIHjBvxRmbL/VO2"], ["updated_at", "2014-12-22 05:31:33.091843"]]